CommunityGD32Cores/pio-gd32-gdlinkcli/OptionBytesXML/GD32A50x.xml
					<brief>0x0800B800~0x0800BFFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 23(0x0800B800~0x0800BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[22]</name>
					<brief>0x0800B000~0x0800B7FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 22(0x0800B000~0x0800B7FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[21]</name>
					<brief>0x0800A800~0x0800AFFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 21(0x0800A800~0x0800AFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[20]</name>
					<brief>0x0800A000~0x0800A7FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 20(0x0800A000~0x0800A7FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[19]</name>
					<brief>0x08009800~0x08009FFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 19(0x08009800~0x08009FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[18]</name>
					<brief>0x08009000~0x080097FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 18(0x08009000~0x080097FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[17]</name>
					<brief>0x08008800~0x08008FFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 17(0x08008800~0x08008FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[16]</name>
					<brief>0x08008000~0x080087FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 16(0x08008000~0x080087FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_BK0WP_N[23:16]</name>
			<displayName>OB_BK0WP_N[23:16]</displayName>
			<addressOffset>0xB</addressOffset>
			<size>0x8</size>
			<access>read</access>
			<reset>0x00</reset>
			<complement>0xD</complement>
			<fields>
				<field>
					<name>OB_BK0WP_N[23:16]</name>
					<brief>OB_BK0WP complement value bit 23 to 16</brief>
					<description>OB_BK0WP complement value bit 23 to 16</description>
					<bitOffset>0</bitOffset>
					<bitWidth>8</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_BK0WP[31:24]</name>
			<displayName>OB_BK0WP[31:24]</displayName>
			<addressOffset>0xE</addressOffset>
			<size>0x8</size>
			<access>read-write</access>
			<reset>0xFF</reset>	
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>OB_BK0WP[31]</name>
					<brief>0x0800F800~0x0800FFFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 31(0x0800F800~0x0800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[30]</name>
					<brief>0x0800F000~0x0800F7FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 30(0x0800F000~0x0800F7FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[29]</name>
					<brief>0x0800E800~0x0800EFFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 29(0x0800E800~0x0800EFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[28]</name>
					<brief>0x0800E000~0x0800E7FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 28(0x0800E000~0x0800E7FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[27]</name>
					<brief>0x0800D800~0x0800DFFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 27(0x0800D800~0x0800DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[26]</name>
					<brief>0x0800D000~0x0800D7FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 26(0x0800D000~0x0800D7FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[25]</name>
					<brief>0x0800C800~0x0800CFFF</brief>
					<description>Page Erase/Program Protection of bank0 bit 25(0x0800C800~0x0800CFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_BK0WP[24]</name>
					<brief>0x0800C000~0x0800C7FF</brief>
					<description>Page Erase/Program Protection of bank0 bit 24(0x0800C000~0x0800C7FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_BK0WP_N[31:24]</name>
			<displayName>OB_BK0WP_N[31:24]</displayName>
			<addressOffset>0xF</addressOffset>
			<size>0x8</size>
			<access>read</access>
			<reset>0x00</reset>
			<complement>0xD</complement>
			<fields>
				<field>
					<name>OB_BK0WP_N[31:24]</name>
					<brief>OB_BK0WP complement value bit 31 to 24</brief>
					<description>OB_BK0WP complement value bit 31 to 24</description>
					<bitOffset>0</bitOffset>
					<bitWidth>8</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_DFWP[7:0]</name>
			<displayName>OB_DFWP[7:0]</displayName>
			<addressOffset>0x12</addressOffset>
			<size>0x8</size>
			<access>read-write</access>
			<reset>0xFF</reset>
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>OB_DFWP[7]</name>
					<brief>0x08803800~0x08803FFF</brief>
					<description>Page Erase/Program Protection of data flash bit 7(0x08803800~0x08803FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[6]</name>
					<brief>0x08803000~0x088037FF</brief>
					<description>Page Erase/Program Protection of data flash bit 6(0x08803000~0x088037FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[5]</name>
					<brief>0x08802800~0x08802FFF</brief>
					<description>Page Erase/Program Protection of data flash bit 5(0x08802800~0x08802FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[4]</name>
					<brief>0x08802000~0x088027FF</brief>
					<description>Page Erase/Program Protection of data flash bit 4(0x08802000~0x088027FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[3]</name>
					<brief>0x08801800~0x08801FFF</brief>
					<description>Page Erase/Program Protection of data flash bit 3(0x08801800~0x08801FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[2]</name>
					<brief>0x08801000~0x088017FF</brief>
					<description>Page Erase/Program Protection of data flash bit 2(0x08801000~0x088017FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[1]</name>
					<brief>0x08800800~0x08800FFF</brief>
					<description>Page Erase/Program Protection of data flash bit 1(0x08800800~0x08800FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_DFWP[0]</name>
					<brief>0x08800000~0x088007FF</brief>
					<description>Page Erase/Program Protection of data flash bit 0(0x08800000~0x088007FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_DFWP_N[7:0]</name>
			<displayName>OB_DFWP_N[7:0]</displayName>
			<addressOffset>0x13</addressOffset>
			<size>0x8</size>
			<access>read</access>
			<reset>0x00</reset>
			<complement>0x8</complement>
			<fields>
				<field>
					<name>OB_DFWP_N[7:0]</name>
					<brief>OB_DFWP complement value bit 7 to 0</brief>
					<description>OB_DFWP complement value bit 7 to 0</description>
					<bitOffset>0</bitOffset>
					<bitWidth>8</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_EPWP[7:0]</name>
			<displayName>OB_EPWP[7:0]</displayName>
			<addressOffset>0x14</addressOffset>
			<size>0x8</size>
			<access>read-write</access>
			<reset>0xFF</reset>
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>OB_EPWP[7]</name>
					<brief>0x08C00380~0x08C003FF</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 7(0x08C00380~0x08C003FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>7</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[6]</name>
					<brief>0x08C00300~0x08C0037F</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 6(0x08C00300~0x08C0037F)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>6</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[5]</name>
					<brief>0x08C00280~0x08C002FF</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 5(0x08C00280~0x08C002FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>5</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[4]</name>
					<brief>0x08C00200~0x08C0027F</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 4(0x08C00200~0x08C0027F)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[3]</name>
					<brief>0x08C00180~0x08C001FF</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 3(0x08C00180~0x08C001FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[2]</name>
					<brief>0x08C00100~0x08C0017F</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 2(0x08C00100~0x08C0017F)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[1]</name>
					<brief>0x08C00080~0x08C000FF</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 1(0x08C00080~0x08C000FF)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				<field>
					<name>OB_EPWP[0]</name>
					<brief>0x08C00000~0x08C0007F</brief>
					<description>Page Erase/Program Protection of EEPROM backup bit 0(0x08C00000~0x08C0007F)&#x000A;0: protection active&#x000A;1: unprotected</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
			</fields>
		</OPByte>
		<OPByte>
			<name>OB_EPWP_N[7:0]</name>
			<displayName>OB_EPWP_N[7:0]</displayName>
			<addressOffset>0x15</addressOffset>
			<size>0x8</size>
			<access>read</access>
			<reset>0x00</reset>
			<complement>0x8</complement>
			<fields>
				<field>
					<name>OB_EPWP_N[7:0]</name>
					<brief>OB_EPWP complement value bit 7 to 0</brief>
					<description>OB_EPWP complement value bit 7 to 0</description>
					<bitOffset>0</bitOffset>
					<bitWidth>8</bitWidth>
				</field>
			</fields>
		</OPByte>
	</OPBytes>
	<OPBytes baseAddress="0x40022068" length="4">
		<OPByte>
			<name>FMC_OB1CS</name>
			<displayName>FMC_OB1CS</displayName>
			<addressOffset>0x0</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<reset>0xFFFF8FF0</reset>	
			<complement>FFFF</complement>
			<fields>
				<field>
					<name>LKVAL[15:0]</name>
					<brief>Option bytes 1 Lock Value</brief>
					<description>Option bytes 1 Lock Value&#x000A;0x33CC : Lock Option bytes 1, the Option bytes 1 cannot be modified any more&#x000A;other value : Do not lock Option bytes 1</description>
					<bitOffset>16</bitOffset>
					<bitWidth>16</bitWidth>
				</field>
				<field>
					<name>EPLOAD</name>
					<brief>Load EPLOAD of option byte 1 after reset</brief>
					<description>Load EPLOAD of option byte 1 after reset. This bit can be write by software when OB1LK is 0</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
				</field>
				 <field>
					<name>EPSIZE[3:0]</name>
					<brief>Load EPSIZE of option byte 1 after reset</brief>
					<description>Load EPSIZE of option byte 1 after reset. These bits can be write by software when OB1LK is 0</description>
					<bitOffset>8</bitOffset>
					<bitWidth>4</bitWidth>
				</field>
				<field>
					<name>EFALC[3:0]</name>
					<brief>Load EFALC of option byte 1 after reset</brief>
					<description>Load EFALC of option byte 1 after reset. These bits can be write by software when OB1LK is 0</description>
					<bitOffset>4</bitOffset>
					<bitWidth>4</bitWidth>
				</field>
			</fields>
		</OPByte>
	</OPBytes>
</OPBytesArchitecture>
